EagleBlood/NXPRobotAI/board/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */
#define PCR_ODE_ode1 0x01u /*!<@brief Open Drain Enable: Enables */
#define PCR_SRE_sre0 0x00u /*!<@brief Slew Rate Enable: Fast */

/*! @name PIO0_6 (coord C14), CLKOUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLKOUT_GPIO GPIO0 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLKOUT_GPIO_PIN 6U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLKOUT_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO0_10 (coord B12), EZH_CAM_VSYNC
  @{ */
/* @} */

/*! @name PIO0_11 (coord B11), EZH_CAM_HSYNC
  @{ */
/* @} */

/*! @name PIO0_14 (coord E11), EZH_CAM_PLCK
  @{ */
/* @} */

/*! @name PIO1_4 (coord A4), EZH_CAM_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D0_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D0_GPIO_PIN 4U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D0_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_5 (coord B3), EZH_CAM_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D1_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D1_GPIO_PIN 5U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_6 (coord B2), EZH_CAM_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D2_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D2_GPIO_PIN 6U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_7 (coord A2), EZH_CAM_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D3_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D3_GPIO_PIN 7U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_8 (coord A1), EZH_CAM_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D4_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D4_GPIO_PIN 8U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D4_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_9 (coord B1), EZH_CAM_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D5_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D5_GPIO_PIN 9U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D5_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_10 (coord C3), EZH_CAM_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D6_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D6_GPIO_PIN 10U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D6_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_11 (coord D3), EZH_CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_D7_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_D7_GPIO_PIN 11U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_D7_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_18 (coord G4), EZH_CAM_PDWN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_PDWN_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_PDWN_GPIO_PIN 18U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_PDWN_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_19 (coord G5), EZH_CAM_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_EZH_CAM_RST_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_EZH_CAM_RST_GPIO_PIN 19U /*!<@brief GPIO pin number */
#define BOARD_INITPINS_EZH_CAM_RST_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name FC0_P0 (coord B10), FC0_I2C_SDA
  @{ */
/* @} */

/*! @name FC0_P1 (coord A10), FC0_I2C_SCL
  @{ */
/* @} */



#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u   /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u   /*!<@brief Pull Select: Enables internal pullup resistor */
#define PCR_SRE_sre1 0x01u /*!<@brief Slew Rate Enable: Slow */

/*! @name PIO0_7 (coord C13), P0_7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLCDFXIOPINS_LCD_RS_GPIO GPIO0 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLCDFXIOPINS_LCD_RS_GPIO_PIN 7U /*!<@brief GPIO pin number */
#define BOARD_INITLCDFXIOPINS_LCD_RS_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO0_12 (coord D11), P0_12/FXIO_LCD_CS/J35[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLCDFXIOPINS_LCD_CS_GPIO GPIO0 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLCDFXIOPINS_LCD_CS_GPIO_PIN 12U /*!<@brief GPIO pin number */
#define BOARD_INITLCDFXIOPINS_LCD_CS_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO1_11 (coord D3), P1_11
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLCDFXIOPINS_LCD_BLK_GPIO GPIO1 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLCDFXIOPINS_LCD_BLK_GPIO_PIN 11U /*!<@brief GPIO pin number */
#define BOARD_INITLCDFXIOPINS_LCD_BLK_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
/* @} */

/*! @name PIO4_7 (coord T4), P4_7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLCDFXIOPINS_LCD_RST_GPIO GPIO4 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLCDFXIOPINS_LCD_RST_GPIO_PIN 7U /*!<@brief GPIO pin number */
#define BOARD_INITLCDFXIOPINS_LCD_RST_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
/* @} */

// MOTOR PINS:

/*! @name PORT4_12 (coord T6), PWMA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_PWMA_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_PWMA_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_PWMA_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT4_13 (coord T7), PWMB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_PWMB_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_PWMB_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_PWMB_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_0 (coord H2), AIN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTOR_AIN1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTOR_AIN1_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITMOTOR_AIN1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_AIN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_AIN1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_AIN1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT1_22 (coord L4), AIN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTOR_AIN2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTOR_AIN2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITMOTOR_AIN2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_AIN2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_AIN2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_AIN2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_3 (coord J3), BIN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTOR_BIN1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTOR_BIN1_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITMOTOR_BIN1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_BIN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_BIN1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_BIN1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_5 (coord K1), BIN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTOR_BIN2_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTOR_BIN2_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITMOTOR_BIN2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITMOTOR_BIN2_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMOTOR_BIN2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTOR_BIN2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDFXIOPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMotor(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
